ERP DEV.WMS/src/DataProcessors/вмс_СерверУправляемыйМодульВводСерии/вмс_СерверУправляемыйМодульВводСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_СерверУправляемыйМодульВводСерии</name>
  <attributes>
    <name>ПараметрыОбработки</name>
  </attributes>
  <attributes>
    <name>ДанныеОбработки</name>
  </attributes>
  <attributes>
    <name>СостояниеОбработки</name>
  </attributes>
  <attributes>
    <name>СтандартныйМодуль</name>
    <type>
      <types>DataProcessorObject.вмс_СерверУправляемыйМодульСтандартный</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ОперацияПоЯчейкам/вмс_ОперацияПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ОперацияПоЯчейкам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьАналитика</name>
    <type>
      <types>CatalogRef.вмс_АналитикаУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/DataProcessors/вмс_СерверУправляемыйМодульВводСерии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем РК;
Перем СтандартныйМодульМенеджер;
Перем ПустоеПолеОбработки;
Перем СоздаватьНовуюСерию;

#Область API
Функция ВыполнитьДействие(Действие) Экспорт
	
	Код = Действие.Код;
	
	ВыполнитьТест = Ложь;
	Если ВыполнитьТест Тогда
		Тест();
	КонецЕсли;
	
	Если Код="ИнициализироватьПоляОбработки" Тогда
		
		ДействиеИнициализироватьПоляОбработки(Действие);
		
	ИначеЕсли Код="ИнициализироватьПараметрыОбработки" Тогда
		
		ДействиеИнициализироватьПараметрыОбработки(Действие);
		
	ИначеЕсли Код="ЗакончитьИнициализациюПолейОбработки" Тогда
		
		ДействиеЗакончитьИнициализациюПолейОбработки(Действие);
		
	ИначеЕсли Код="ИнициализироватьДанныеОбработки" Тогда
		
		ДействиеИнициализироватьДанныеОбработки(Действие);
		
	ИначеЕсли Код="ИнициализироватьЭтапыВводаДанных" Тогда
		
		ДействиеИнициализироватьЭтапыВводаДанных(Действие);
		
	ИначеЕсли Код="НачалоОбработки" Тогда
		
		ДействиеНачалоОбработки(Действие);
		
	ИначеЕсли Код="ПриОткрытииФормыОбработки" Тогда
		
		ДействиеПриОткрытииФормыОбработки(Действие);
		
	ИначеЕсли Код="ПолучениеФормыОбработки" Тогда
		
		//УстановитьРезультатДействия(Действие, "ФормаОперацииНовая");
		
	ИначеЕсли Код="ВыборЭлементаТаблицы" Тогда
		
		ДействиеВыборЭлементаТаблицы(Действие);
		
	ИначеЕсли Код="ПослеЗавершенияВвода" Тогда
		
		ДействиеПослеЗавершенияВвода(Действие);
		
	КонецЕсли;
	
	Возврат Действие.Результат;
	
КонецФункции
#КонецОбласти

Функция Тест()
	
	СтандартныйМодуль.РазгруппироватьЭлементыВывода("КнопкаПодтвердить, КнопкаОтмена");
	
КонецФункции

Функция ДействиеИнициализироватьПоляОбработки(Действие)
	
	Перем Товар;
	
	УстановитьСвойстваЭлементовВывода("ГлавнаяПанельСтраницаПланФакт", Новый Структура("Заголовок", "Выбор"));

	ЗначениеПоля = Неопределено;
	ДанныеТовара = Неопределено;
	ПараметрыИнициализации = СостояниеОбработки.ПараметрыИнициализации;
	Если ТипЗнч(ПараметрыИнициализации) <> Тип("Структура") Тогда
		ПараметрыИнициализации = Новый Структура;
	КонецЕсли;
	
	ПараметрыИнициализации.Свойство("ДанныеТовара", ДанныеТовара);
	Если ТипЗнч(ДанныеТовара) <> Тип("Структура") Тогда
		ДанныеТовара = Новый Структура;
	КонецЕсли;
	
	ИсключенияВвода = РК.ЗначениеВМассив("СерияУчета, ВидНоменклатуры");
	ИсключенияВывода = РК.ЗначениеВМассив("СерияУчета");
	Если вмс_АдаптацияКонфигураций.ИмяРеквизитаНоменклатурыВладелецСерии()="Ссылка" Тогда
		//уже есть поле товар, не выводить еще раз ссылку товара в поле "Вид"
		ИсключенияВывода.Добавить("ВидНоменклатуры");
	КонецЕсли;
	
	ДанныеТовара.Свойство("Серия", ЗначениеПоля);
	УстановитьСвойстваПолейОбработки("Серия", Новый Структура("Вывод, Значение", Ложь, ЗначениеПоля));	
	УстановитьСвойстваПолейОбработки("Ячейка", Новый Структура("Вывод, Значение", Ложь, Неопределено));	
	
	ПараметрыИнициализации.Свойство("Склад", ЗначениеПоля);
	УстановитьСвойстваПолейОбработки("Склад", Новый Структура("Вывод, Значение", Ложь, ЗначениеПоля));
	
	ДанныеТовара.Свойство("Товар", Товар);
	УстановитьСвойстваПолейОбработки("Товар", Новый Структура("Использование, Значение", Истина, Товар));
	
	Если ДанныеТовара.Свойство("Характеристика", ЗначениеПоля) Тогда
		УстановитьСвойстваПолейОбработки("Характеристика", Новый Структура("Использование, Значение", Истина, ЗначениеПоля));
	КонецЕсли;
	СтандартныйМодуль.УстановитьСвойстваЭлементовВывода("Товар", "Высота", 2);
	
	Для Каждого РеквизитСерии Из Метаданные.Справочники.вмс_СерииНоменклатуры.Реквизиты Цикл
		ИмяПоля = РеквизитСерии.Имя;
		Ввод = ИсключенияВвода.Найти(ИмяПоля)=Неопределено;
		Вывод = ИсключенияВывода.Найти(ИмяПоля)=Неопределено;
		СвойстваПоля = Новый Структура("Ввод, Вывод, Сборка, Синоним, ТипЗначения, ЗначениеПоУмолчанию", Ввод, Вывод, Истина, РеквизитСерии.Синоним, РеквизитСерии.Тип, РеквизитСерии.Тип.ПривестиЗначение());
		УстановитьСвойстваПолейОбработки(ИмяПоля, СвойстваПоля);
	КонецЦикла;
	
	Если ПараметрыИнициализации.Свойство("ВидНоменклатуры") Тогда
		ВидНоменклатуры = ПараметрыИнициализации.ВидНоменклатуры;
	КонецЕсли;
	
	Если ВидНоменклатуры=Неопределено Тогда
		ИмяРеквизитаВладелецСерии = вмс_АдаптацияКонфигураций.ИмяРеквизитаНоменклатурыВладелецСерии();
		ВидНоменклатуры = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(Товар, ИмяРеквизитаВладелецСерии);
	КонецЕсли;
	
	УстановитьЗначениеДанныхПоляОбработки("ВидНоменклатуры", ВидНоменклатуры);
	
	УстановитьСвойстваПолейОбработки("КнопкаПодтвердить", Новый Структура("ТипЭлемента, Синоним", "КнопкаФормы", "ОК"));
	СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки("КнопкаПодтвердить", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикНажатияКнопкиПодтвердить")));
	УстановитьСвойстваПолейОбработки("КнопкаПечать", Новый Структура("ТипЭлемента, Синоним", "КнопкаФормы", "Печать"));
	СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки("КнопкаПечать", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикНажатияКнопкиПечать")));
	//3.2.5 ZAD-48:
	УстановитьСвойстваПолейОбработки("КнопкаНовыйНомер", Новый Структура("ТипЭлемента, Синоним", "КнопкаФормы", "Заполнить номер"));
	СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки("КнопкаНовыйНомер", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикНажатияКнопкиНовыйНомер")));
	//3.2.5 ZAD-48:
	УстановитьСвойстваПолейОбработки("КнопкаОтмена", Новый Структура("ТипЭлемента, Синоним", "КнопкаФормы", "Отмена"));
	СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки("КнопкаОтмена", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикНажатияКнопкиОтмена")));
	
	
	УстановитьТаблицуОбработки("ОстаткиСерий", "Серия, Ячейка, Остаток");
	УстановитьМестоположениеТаблицыОбработки("ОстаткиСерий", "ГлавнаяПанельСтраницаПланФакт");

	Если СостояниеОбработки.ПараметрыИнициализации.ВерсияМобильногоКлиента >= "2.1.3" Тогда
		// возможность указать вид группы доступна с версии "2.1.3"
		СтандартныйМодуль.СгруппироватьЭлементыВывода("ОстаткиСерийСерия, ОстаткиСерийЯчейка", "Вертикальная");
	КонецЕсли;
	УстановитьСвойстваЭлементовВывода("ОстаткиСерийОстаток", Новый Структура("Ширина", 1));
	
	Возврат УстановитьРезультатДействия(Действие, Истина);
	
КонецФункции

Функция ДействиеЗакончитьИнициализациюПолейОбработки(Действие)
	
	СтандартныйМодуль.СгруппироватьЭлементыВывода("КнопкаПодтвердить, КнопкаПечать, КнопкаОтмена");
	//СтандартныйМодуль.СгруппироватьЭлементыВывода("Товар, ГоденДо", "Вертикальная");
	
КонецФункции

Функция ДействиеИнициализироватьПараметрыОбработки(Действие)
	
	Если ДействиеВыполняетсяПосле(Действие) Тогда
		ПустоеПолеОбработки = ПараметрыОбработки.ПустоеПолеОбработки;
		
		СоздаватьНовуюСерию = Ложь;
		
		ПараметрыИнициализации = СостояниеОбработки.ПараметрыИнициализации;
		Если ТипЗнч(ПараметрыИнициализации)=Тип("Структура") Тогда
			СоздаватьНовуюСерию = ПараметрыИнициализации.Свойство("СоздаватьНовуюСерию") И ПараметрыИнициализации.СоздаватьНовуюСерию=Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ДействиеИнициализироватьДанныеОбработки(Действие)
	
КонецФункции

Функция ЗаполнитьТаблицуОстатковСерий()
	
	ПараметрыИнициализации = СостояниеОбработки.ПараметрыИнициализации;
	
	Если ПараметрыИнициализации.Свойство("ТаблицаОстатков") Тогда
		ТаблицаОстатков = ПараметрыИнициализации.ТаблицаОстатков;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия,
		|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
		|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
		|			,
		|			Товар = &Товар
		|				И Ячейка.Владелец = &Склад) КАК вмс_ОперацияПоЯчейкамОстатки";
		Запрос.УстановитьПараметр("Склад", ПолучитьЗначениеДанныхПоляОбработки("Склад"));
		Запрос.УстановитьПараметр("Товар", ПолучитьЗначениеДанныхПоляОбработки("Товар"));
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	РК.УстановитьЭлементыКоллекции(ДанныеОбработки.Таблицы.ОстаткиСерий, ТаблицаОстатков);
	
КонецФункции

Функция	ДействиеИнициализироватьЭтапыВводаДанных(Действие)
	
	Если ДействиеВыполняетсяПосле(Действие) Тогда
		
		ДобавитьЭтапВводаДанных("ОбработчикЭтапаВводаДанных_СохранениеДанных", "СохранениеДанных");
		
	КонецЕсли;
	
КонецФункции

Функция ДействиеНачалоОбработки(Действие)
	
	ЗаполнитьТаблицуОстатковСерий();
	
	Серия = ПолучитьЗначениеДанныхПоляОбработки("Серия");
	ЗаполнитьРеквизитыСерии(Серия);
	
КонецФункции

Функция ДействиеПриОткрытииФормыОбработки(Действие)
	
	УстановитьЗаголовокФормы("Ввод серии");
	
КонецФункции

Функция ДействиеВыборЭлементаТаблицы(Действие)
	
	ИмяТаблицы = Действие.Параметры.ИмяТаблицы;
	
	ЭлементТаблицы = ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, Действие.Параметры.ИдентификаторЭлемента);
	
	Если ИмяТаблицы="ОстаткиСерий" Тогда
		
		ЗаполнитьРеквизитыСерии(ЭлементТаблицы.Серия);
		УстановитьЗначениеДанныхПоляОбработки("Ячейка", ЭлементТаблицы.Ячейка);
		СтандартныйМодуль.ПереключитьСтраницу("ВводДанных");
		
		//Результат = Новый Структура("Серия", ЭлементТаблицы.Серия);
		//вмс_СерверУправляемыеОбработки.ЗавершитьРаботуОбработки(ПараметрыОбработки, Результат);
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьРеквизитыСерии(Серия)
	
	СписокПолейВвода = СписокПолейОбработки(Новый Структура("Ввод", Истина));
	ДанныеПолей = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначенияРеквизитовОбъекта(Серия, СписокПолейВвода);
	СтандартныйМодуль.ВвестиДанные(ДанныеПолей);
	
	//установим явно ссылку на серию после поиска по реквизитам (устраняет проблему с дублями серии)
	//поиск по реквизитам будет использован при редактировании реквизитов серии пользователем
	УстановитьЗначениеДанныхПоляОбработки("Серия", Серия);
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
//
//					Ввод данных+
//

Функция ОбработчикЭтапаВводаДанных_СохранениеДанных(НаборДанных, ДополнительныеПараметры) Экспорт
	
	
КонецФункции

Функция ОбработчикНажатияКнопкиПодтвердить(Результат, ДополнительныеПараметры) Экспорт
	
	Серия = ПолучитьЗначениеДанныхПоляОбработки("Серия");
	
	//3.2.5 ZAD-48:
	РеквизитыСерии = ПолучитьРеквизитыСерии();
	
	Если Не ПроверитьРеквизитыСерии(РеквизитыСерии) Тогда
		Возврат Ложь;
	КонецЕсли;
	//3.2.5 ZAD-48:
	
	Если НЕ ЗначениеЗаполнено(Серия) Тогда
		Серия = ПолучитьСерию();
	КонецЕсли;
	
	Ячейка = ПолучитьЗначениеДанныхПоляОбработки("Ячейка");
	
	ВходящиеДанные = СтандартныйМодульМенеджер.НовыеВходящиеДанные();
	ВходящиеДанные.ВходящиеОбъекты.Добавить(Серия);
	Если ЗначениеЗаполнено(Ячейка) Тогда
		ВходящиеДанные.ВходящиеОбъекты.Добавить(Ячейка);
	КонецЕсли;
	вмс_СерверУправляемыеОбработки.ЗавершитьРаботуОбработки(ПараметрыОбработки, ВходящиеДанные);
	
КонецФункции

//3.2.5 ZAD-48:
Функция ОбработчикНажатияКнопкиНовыйНомер(Результат, ДополнительныеПараметры) Экспорт
	
	СлучайныйНомер = вмс_СерииТоваровСервер.СгенерироватьСлучайныйНомерСерии();
	СтандартныйМодуль.ВвестиДанныеПоля("Номер", СлучайныйНомер);
		
КонецФункции

Функция ОбработчикНажатияКнопкиПечать(Результат, ДополнительныеПараметры) Экспорт
	
	НачатьТранзакцию();
	РеквизитыСерии = ПолучитьРеквизитыСерии();
	
	//3.2.5 ZAD-48:
	Если Не ПроверитьРеквизитыСерии(РеквизитыСерии) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Серия = вмс_СерииТоваровСервер.ПолучитьСерию(РеквизитыСерии);
	Если Серия=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеШК = Новый Структура;
	Для Каждого Поле Из ПоляОбработки("Товар, Характеристика") Цикл
		Если Поле.Имя="Товар" Тогда
			ИмяПоля = "Номенклатура";
		Иначе
			ИмяПоля = Поле.Имя;
		КонецЕсли;
		
		ДанныеШК.Вставить(ИмяПоля, Поле.Значение);
	КонецЦикла;
	ДанныеШК.Вставить("Серия", Серия);
	вмс_СерииТоваровСервер.ЗаписатьШтрихкодСерии(ДанныеШК, РеквизитыСерии);
	
	Этикетка = вмс_Печать.СформироватьПечатнуюФормуСерии(РеквизитыСерии);
	
	Если СтандартныйМодуль.НачатьПечать(Этикетка) Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецФункции

Функция ОбработчикНажатияКнопкиОтмена(Результат, ДополнительныеПараметры) Экспорт
	
	вмс_СерверУправляемыеОбработки.ЗавершитьРаботуОбработки(ПараметрыОбработки, Неопределено);
	
КонецФункции

Функция ДействиеПослеЗавершенияВвода(Действие)
	
	УстановитьЗначениеДанныхПоляОбработки("Серия", НайтиСерию());
	УстановитьЗначениеДанныхПоляОбработки("Ячейка", Неопределено);
	
	ОбновитьПредставлениеКнопок();
	
КонецФункции

Функция ОбновитьПредставлениеКнопок()
	
	ПолеКнопки = ПолеОбработки("КнопкаПодтвердить");
	Если ПолеКнопки=ПустоеПолеОбработки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолеКнопкиПечать = ПолеОбработки("КнопкаПечать");
	
	Серия = ПолучитьЗначениеДанныхПоляОбработки("Серия");
	
	Если ЗначениеЗаполнено(Серия) ИЛИ НЕ СоздаватьНовуюСерию Тогда
		СвойстваКнопки = Новый Структура("Заголовок, ЦветФона", "Выбрать", Новый Цвет);
		СвойстваКнопки.Вставить("Доступность", ЗначениеЗаполнено(Серия));
	Иначе
		СвойстваКнопки = Новый Структура("Заголовок, ЦветФона, Доступность", "Создать", Новый Цвет(220, 255, 220), Истина);
		СвойстваКнопки.Вставить("Доступность", ЗначениеЗаполнено(ДанныеОбработки.СобранныеДанныеПолей.ГоденДо) И ЗначениеЗаполнено(ДанныеОбработки.СобранныеДанныеПолей.ДатаПроизводства)); 
	КонецЕсли;
	
	ЭлементКнопки = СтандартныйМодуль.ПолучитьЭлементВыводаДляПоляОбработки(ПолеКнопки.ИмяЭлементаВывода, ПолеКнопки);
	УстановитьСвойстваЭлементовВывода(ЭлементКнопки, СвойстваКнопки);
	
	ЭлементКнопкиПечать = СтандартныйМодуль.ПолучитьЭлементВыводаДляПоляОбработки(ПолеКнопкиПечать.ИмяЭлементаВывода, ПолеКнопкиПечать);
	УстановитьСвойстваЭлементовВывода(ЭлементКнопкиПечать, Новый Структура("Доступность", СвойстваКнопки.Доступность));
	
КонецФункции

Функция НайтиСерию()
	
	РеквизитыСерии = ПолучитьРеквизитыСерии();
	СсылкаНаСерию = вмс_СерииТоваровСервер.НайтиСерию(РеквизитыСерии);
	Возврат СсылкаНаСерию;
	
КонецФункции

Функция ПолучитьСерию()
	
	РеквизитыСерии = ПолучитьРеквизитыСерии();
	СсылкаНаСерию = вмс_СерииТоваровСервер.ПолучитьСерию(РеквизитыСерии);
	Возврат СсылкаНаСерию;
	
КонецФункции

Функция ПолучитьРеквизитыСерии()
	
	РеквизитыСерии = Новый Структура;
	Для Каждого ПолеСборки Из ПоляОбработки(Новый Структура("Сборка", Истина)) Цикл
		РеквизитыСерии.Вставить(ПолеСборки.Имя, ДанныеОбработки.СобранныеДанныеПолей[ПолеСборки.Имя]);
	КонецЦикла;
	
	Возврат РеквизитыСерии;
	
КонецФункции

//3.2.5 ZAD-48:
Функция ПроверитьРеквизитыСерии(РеквизитыСерии)
		
	// Проверяем, что заполнены обязательные поля
	Серия = ПолучитьЗначениеДанныхПоляОбработки("Серия");
	
	ДатаПроизводстваПустая = РеквизитыСерии.Свойство("ДатаПроизводства") И НЕ ЗначениеЗаполнено(РеквизитыСерии.ДатаПроизводства);
	ГоденДоПустая = РеквизитыСерии.Свойство("ГоденДо") И НЕ ЗначениеЗаполнено(РеквизитыСерии.ГоденДо); а=0;
	
	// Если создаем новую серию - проверяем обязательные поля
	Если НЕ ЗначениеЗаполнено(Серия) Тогда
		
		Если ГоденДоПустая Тогда
			ПоказатьДиалогНаКлиенте(, "Не заполнена дата годности!");
			Возврат Ложь; // Остановка выполнения
		КонецЕсли;
		
		Если ДатаПроизводстваПустая Тогда
			ПоказатьДиалогНаКлиенте(, "Не заполнена дата производства!");
			Возврат Ложь; // Остановка выполнения
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка логики: дата производства не может быть больше даты годности
	Если НЕ ДатаПроизводстваПустая И Не ГоденДоПустая Тогда
		Если РеквизитыСерии.ДатаПроизводства > РеквизитыСерии.ГоденДо Тогда
			ПоказатьДиалогНаКлиенте(, "Дата производства не может быть больше даты годности!");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина; // Продолжить выполнение
		
КонецФункции


//
//					Ввод данных-
//
//////////////////////////////////////////////////////////////////////////////////



























#Область ОбъявленияФункций
Функция УстановитьТаблицуОбработки(ИмяТаблицы, Источник, Видимость=Истина, знач ПоляВывода=Неопределено) Экспорт
	
	Возврат СтандартныйМодуль.УстановитьТаблицуОбработки(ИмяТаблицы, Источник, Видимость, ПоляВывода);
	
КонецФункции

Функция УстановитьВидимостьТаблицыОбработки(ИмяТаблицы, Видимость) Экспорт

	Возврат СтандартныйМодуль.УстановитьВидимостьТаблицыОбработки(ИмяТаблицы, Видимость);
	
КонецФункции

Функция УстановитьМестоположениеТаблицыОбработки(ИмяТаблицы, МестоПоложение) Экспорт

	Возврат СтандартныйМодуль.УстановитьМестоположениеТаблицыОбработки(ИмяТаблицы, МестоПоложение);
	
КонецФункции

Функция ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, ИдентификаторЭлемента)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, ИдентификаторЭлемента);
	
КонецФункции

Функция ОткрытьФормуОбработки(ИмяФормы)
	
	ДобавитьДействиеНаКлиенте("ОткрытьФормуОбработки", Новый Структура("ИмяФормы", ИмяФормы));
	
КонецФункции

Функция УстановитьЗаголовокФормы(Заголовок)
	
	Возврат ДобавитьДействиеНаКлиенте("УстановитьЗаголовок", Заголовок);
	
КонецФункции

Функция ДобавитьЭтапВводаДанных(ОписаниеОбработчика, Группа, Место=Неопределено, Параметр=Неопределено, Имя=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ДобавитьЭтапВводаДанных", Новый Структура("ОписаниеОбработчика, Группа, Место, Параметр, Имя", ОписаниеОбработчика, Группа, Место, Параметр, Имя)));
	
КонецФункции

Функция ПоказатьДиалогНаКлиенте(ОписаниеОповещения=Неопределено, Текст, знач Кнопки=Неопределено, знач Таймаут=Неопределено, КнопкаПоУмолчанию=Неопределено, Заголовок=Неопределено)
	
	Возврат СтандартныйМодуль.ПоказатьДиалогНаКлиенте(ОписаниеОповещения, Текст, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок);
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, знач Модуль=Неопределено, ДополнительныеПараметры=Неопределено, ИмяПроцедурыОбработкиОшибки=Неопределено, МодульОбработкиОшибки=Неопределено)
	
	Если Модуль=Неопределено Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	Возврат вмс_СерверУправляемыеОбработки.НовыйОписаниеОповещения(ИмяПроцедуры, ПараметрыОбработки, Модуль, ДополнительныеПараметры, ИмяПроцедурыОбработкиОшибки, МодульОбработкиОшибки);
	
КонецФункции

Функция ДобавитьДействиеНаКлиенте(КодДействие, знач ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ДобавитьДействиеНаКлиенте(ПараметрыОбработки, КодДействие, ПараметрыДействия);
	
КонецФункции

Функция ДействиеВыполняетсяПосле(Действие) Экспорт
	
	Возврат вмс_СерверУправляемыеОбработки.ДействиеВыполняетсяПосле(Действие);
	
КонецФункции

Функция УстановитьРезультатДействия(Действие, Результат=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Результат);
	
КонецФункции

Функция Действие(Код, ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.Действие(Код, ПараметрыДействия, ПараметрыОбработки.Идентификатор, ПараметрыОбработки, ЭтотОбъект);
	
КонецФункции

Функция УстановитьСвойстваЭлементовВывода(Элементы, Свойства=Неопределено, ЗначениеСвойства=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства);
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
//
//				Поля обработки+
//

//возвращает всю таблицу полей или массив полей по отбору
Функция ПоляОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ПолеОбработки(Отбор)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

//возвращает поля с указанными именами, если поля нет, то создает новое
Функция ПолучитьПоляОбработки(Поля=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьПоляОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьСвойстваПолейОбработки(Поля=Неопределено, Свойства=Неопределено, Значение=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поля, Свойства, Значение);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПоляОбработки(Поле, ИмяСвойства)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеСвойстваПоляОбработки(ПараметрыОбработки, Поле, ИмяСвойства);
	
КонецФункции

Функция УстановитьПоляВводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьПоляВыводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВыводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьЗначениеДанныхПоляОбработки(Поле, Значение) Экспорт
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле, Значение);
	
КонецФункции

Функция СписокПолейВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВвода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВвода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВывода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВывода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ТаблицаПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ТаблицаПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ПолучитьЗначениеДанныхПоляОбработки(Поле)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле);
	
КонецФункции

//
//				Поля обработки-
//
/////////////////////////////////////////////////////////////////////////
#КонецОбласти

РК = вмс_РаботаСКоллекциями;
СтандартныйМодульМенеджер = Обработки.вмс_СерверУправляемыйМодульСтандартный;
	
#КонецЕсли
